import { DocumentAttachmentIcon, Home01Icon, User02Icon } from '@hugeicons/core-free-icons'

import type { SidebarItem } from '@/types/sidebar-items.type'

export const COOKIE_NAME = 'auth'

export const PUBLIC_ROUTES = ['/']

export const SIDEBAR_ITEMS: SidebarItem[] = [
  {
    label: 'Главная',
    icon: Home01Icon,
    href: '/dashboard'
  },
  {
    label: 'Документы',
    icon: DocumentAttachmentIcon,
    href: '/documents'
  },
  {
    label: 'Клиенты',
    icon: User02Icon,
    href: '/customers'
  }
]

export const welcomeDescriptions = [
  'Все ваши документы и клиенты в одном месте.',
  'Создавайте документы за минуты, а не часы.',
  'Управляйте документами и клиентами легко и быстро.',
  'Управляйте клиентами, шаблонами и документами без лишней рутины.',
  'Меньше ручной работы — больше времени на важное.',
  'Заполняйте данные один раз. Остальное система сделает сама.',
  'Создавайте договоры и документы за несколько кликов.',
  'Все шаблоны, клиенты и документы под рукой.',
  'Время деньги',
  'Мы автоматизировали документы, чтобы вам не пришлось копировать одни и те же данные в четвёртый раз.',
  'Спасаем людей от Excel-таблиц и бесконечного Ctrl+C → Ctrl+V с 2025 года.',
  'Заполните данные один раз. Почувствуйте себя программистом, автоматизировавшим работу бухгалтера.',
  'Система была создана после того, как кто-то в очередной раз ошибся в номере договора.',
  'Генерируем документы быстрее, чем вы успеете спросить: «А где прошлый клиент?»',
  'Потому что жизнь слишком коротка, чтобы вручную заполнять четыре одинаковых документа.',
  'Нажмите одну кнопку. Сделайте вид, что работали весь день.',
  'Превращаем 15 минут рутины в 15 секунд автоматизации.',
  'Потому что рутины — это время, которое можно посвятить более важным задачам.',
  'Ваш персональный сотрудник по копированию данных. Не жалуется, не уходит в отпуск.',
  'Создано для людей, которым надоело каждый раз перепечатывать одни и те же данные и надеяться, что ошибок нет.',
  'Если документ заполнился сам — это не магия, это Адиль наконец-то автоматизировал процесс.',
  'Мама, сегодня без ошибок в договорах, пожалуйста 😄'
]
